Revit 2026 API

# PDFExportOptionsIsValidNamingRule Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidNamingRule(
	IList<TableCellCombinedParameterData> namingRule
)
```
```vb
Public Shared Function IsValidNamingRule (
	namingRule As IList(Of TableCellCombinedParameterData)
) As Boolean
```
```cpp
public:
static bool IsValidNamingRule(
	IList<TableCellCombinedParameterData^>^ namingRule
)
```
```fsharp
static member IsValidNamingRule :
        namingRule : IList<TableCellCombinedParameterData> -> bool
```

#### Parameters

namingRule IListTableCellCombinedParameterData

#### Return Value

Boolean

#### Reference

PDFExportOptions Class

Autodesk.Revit.DB Namespace